{
  "backend/main.mo": "Defines an empty Motoko actor with no functionality.",
  "feature_evidence.json": "JSON report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference list summarizing major frontend files and their purposes.",
  "frontend/index.css": "Tailwind-based global styles defining CSS variables for light/dark themes and base layout styling.",
  "frontend/index.html": "Base HTML file setting up the root div and loading the main React entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and toaster notifications.",
  "frontend/src/components/inquiry/InquirySummaryButton.tsx": "Inquiry list button showing total item count and navigating to the inquiry page.",
  "frontend/src/components/site/Footer.tsx": "Footer displaying contact links, address, social icons, and quick navigation links.",
  "frontend/src/components/site/Header.tsx": "Sticky header with site logo, contact links, navigation buttons, and inquiry summary button.",
  "frontend/src/components/site/InteractiveBackground.tsx": "Canvas component rendering animated blueprint background with mouse‑reactive particles.",
  "frontend/src/components/site/PageTransition.tsx": "Wrapper applying a fade‑in animation to page transitions.",
  "frontend/src/components/site/SiteLayout.tsx": "Defines the main site layout with header, footer, background, and routed content wrapped in a page transition.",
  "frontend/src/config/contact.ts": "Exports static contact details including phone numbers, email, address, and map URLs.",
  "frontend/src/data/catalog.ts": "Defines product categories with IDs, descriptions, and icons.",
  "frontend/src/data/inventory.ts": "Provides a static list of products keyed by category with names, descriptions, and brands.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInquiry.ts": "Wraps inquiry store actions and returns items plus utility functions like counting totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider handling login, stored identities, and status management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for future backend queries.",
  "frontend/src/index.css": "Sets up Tailwind styles, themes, CSS variables, and global UI effects.",
  "frontend/src/main.tsx": "Bootstraps the app with React, Internet Identity provider, React Query, and global styles.",
  "frontend/src/pages/CategoryPage.tsx": "Renders a category view showing products and allows adding, updating, or removing items from the inquiry list.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with phone, email, and business hours using data from CONTACT_INFO.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero text, product categories grid, and CTA navigation to contact.",
  "frontend/src/pages/InquiryPage.tsx": "Shows the inquiry list with quantity controls and navigation to proceed or return home.",
  "frontend/src/pages/LeadFormPage.tsx": "Implements a lead submission form with validation, saving submissions, and redirecting on success.",
  "frontend/src/pages/LeadSuccessPage.tsx": "Displays a success message and clears the inquiry list after a form submission.",
  "frontend/src/state/inquiryStore.ts": "Defines a persisted Zustand store for managing inquiry items and quantity updates.",
  "frontend/src/storage/submissions.ts": "Handles saving, retrieving, and clearing lead submissions in localStorage.",
  "frontend/src/styles/effects.css": "Provides 3D text and card hover effects with responsive behavior.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color system, fonts, animations, and plugin integrations.",
  "project_state.json": "Project state file defining site goals, requirements, architectural notes, and existing features for a lead-generation website."
}