{
  "backend/main.mo": "Motoko canister managing admin-gated blog CRUD and user profiles with access control and simple post storage in Maps.",
  "backend/migration.mo": "Stub migration module returning an empty upgraded state.",
  "feature_evidence.json": "Feature evidence listing blog-related frontend features, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend components and pages for reference.",
  "frontend/index.css": "Tailwind base styles with extensive CSS variables for light/dark themes and global element styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all public and admin pages and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/auth/AdminGate.tsx": "Gate component that checks Internet Identity admin status before rendering protected admin pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/blog/BlogPostContentRenderer.tsx": "Renders blog post content blocks, supporting text and inline images parsed from JSON.",
  "frontend/src/components/blog/BlogPostEditor.tsx": "A block-based blog editor allowing users to add, reorder, update, and remove text and image blocks, syncing changes as JSON.",
  "frontend/src/components/inquiry/InquirySummaryButton.tsx": "Button showing inquiry list count and navigating to the inquiry page with a cart icon badge.",
  "frontend/src/components/site/Footer.tsx": "Footer displaying contact info, navigation links, address, and social icons with dynamic year handling.",
  "frontend/src/components/site/Header.tsx": "Sticky site header with logo, navigation buttons, contact info, and an inquiry summary button.",
  "frontend/src/components/site/HomeBackgroundVideo.tsx": "Full-screen autoplaying background video with error handling and a gradient fallback.",
  "frontend/src/components/site/InteractiveBackground.tsx": "Canvas-based animated background rendering floating hardware parts with parallax and reduced-motion support.",
  "frontend/src/components/site/PageTransition.tsx": "Wrapper applying a fade-in animation to page content.",
  "frontend/src/components/site/SiteLayout.tsx": "Root layout combining background canvas, header, routed content with transitions, and footer.",
  "frontend/src/config/contact.ts": "Static contact configuration including phone numbers, email, address, and map URLs.",
  "frontend/src/config/site.ts": "Site metadata constants such as name, URL, and description.",
  "frontend/src/data/catalog.ts": "Defines product categories with icons, IDs, names, and descriptions for catalog display.",
  "frontend/src/data/gallery.ts": "Generates gallery items from static image paths using inferred metadata and provides category extraction.",
  "frontend/src/data/inventory.ts": "Defines a Product interface and a hardcoded inventory list of construction materials with ids, categories, and image paths.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBlog.ts": "Provides React Query hooks for fetching blog posts, categories, and tags using the backend actor.",
  "frontend/src/hooks/useBlogAdmin.ts": "Defines mutations for creating, updating, deleting blog posts and checking admin status through the backend actor.",
  "frontend/src/hooks/useInquiry.ts": "Wraps the inquiry store, exposing item management functions and a total count helper.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing login, logout, stored identity, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning an empty object for future backend-integrated queries.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and custom design tokens for light and dark themes including colors and utilities.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity provider around the root App component.",
  "frontend/src/pages/BlogAdminEditPage.tsx": "Admin page for creating and editing blog posts, loading existing data, handling form state, and submitting mutations.",
  "frontend/src/pages/BlogAdminPage.tsx": "Admin interface for viewing, sorting, editing, and deleting blog posts with loading states and navigation controls.",
  "frontend/src/pages/BlogListPage.tsx": "Displays all blog posts with search, category, and tag filtering plus navigation to individual posts.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a single blog post with metadata and rendered content, including loading and not-found handling.",
  "frontend/src/pages/CategoryPage.tsx": "Displays products within a selected category and allows managing an inquiry list with quantity controls.",
  "frontend/src/pages/ContactPage.tsx": "Contact information page featuring phone, email, operational hours, and location details in card sections.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a filterable product gallery with category buttons and product cards, plus a contact CTA section.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, category grid linking to product pages, and a contact CTA.",
  "frontend/src/pages/InquiryPage.tsx": "Shows the user's inquiry list with quantity controls, removal options, and navigation to the lead form.",
  "frontend/src/pages/LeadFormPage.tsx": "Contains a customer details form with validation and saves the inquiry submission before navigating to success.",
  "frontend/src/pages/LeadSuccessPage.tsx": "Displays a confirmation message after form submission and clears the inquiry list.",
  "frontend/src/state/inquiryStore.ts": "Zustand store managing inquiry items with add, increment, decrement, remove, and clear actions, persisted in localStorage.",
  "frontend/src/storage/submissions.ts": "Utilities to save, retrieve, and clear lead form submissions stored in localStorage.",
  "frontend/src/styles/effects.css": "Defines 3D text and card hover effects along with responsive interaction styling.",
  "frontend/src/utils/galleryInference.ts": "Provides functions to parse filenames, generate display names, and infer product categories using keyword scoring for gallery items.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters, including support for hash-based routing and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, shadows, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Tracks the project’s current requirements, architecture notes, and features, defining the site’s goals and build state metadata."
}