{
  "backend/main.mo": "Defines an empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report describing URL configuration requirements and associated files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files related to routing, layout, pages, data, and styles.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark themes and applying global styles.",
  "frontend/index.html": "Minimal HTML shell loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all routes and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/inquiry/InquirySummaryButton.tsx": "Button showing inquiry item count and navigating to the inquiry page.",
  "frontend/src/components/site/Footer.tsx": "Footer with company info, contact links, quick navigation links, and social icons.",
  "frontend/src/components/site/Header.tsx": "Sticky header with logo, navigation buttons, and contact info bar.",
  "frontend/src/components/site/HomeBackgroundVideo.tsx": "Background video component with autoplay handling and fallback gradient.",
  "frontend/src/components/site/InteractiveBackground.tsx": "Canvas-based animated blueprint background with parallax and particle effects.",
  "frontend/src/components/site/PageTransition.tsx": "Wraps children in a div with fade-in animation for page transitions.",
  "frontend/src/components/site/SiteLayout.tsx": "Defines the main site layout with header, footer, background, and page transition wrapper.",
  "frontend/src/config/contact.ts": "Exports static contact details including phone numbers, email, address, and map URLs.",
  "frontend/src/config/site.ts": "Provides basic site configuration such as name, URL, and description.",
  "frontend/src/data/catalog.ts": "Defines product categories with IDs, names, descriptions, and icons.",
  "frontend/src/data/gallery.ts": "Generates gallery items from static image paths using inferred metadata and exposes category utilities.",
  "frontend/src/data/inventory.ts": "Contains the full product inventory with IDs, categories, descriptions, and image paths.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refreshing on identity changes.",
  "frontend/src/hooks/useInquiry.ts": "Provides access to inquiry list state with add, modify, remove, and count utilities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, managing login, logout, identity loading, and state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning an empty object for future backend queries.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining color variables, themes, and UI utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/CategoryPage.tsx": "Renders a category view with product listings, inquiry interactions, and navigation controls.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact options including phone, email, and business hours using UI cards and CONTACT_INFO config.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a filterable product gallery with category buttons, item cards, and a contact CTA.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with a hero section, clickable product category cards, and a contact CTA.",
  "frontend/src/pages/InquiryPage.tsx": "Manages the inquiry list, allowing quantity updates, item removal, and navigation to the lead form.",
  "frontend/src/pages/LeadFormPage.tsx": "Provides a form for submitting inquiry details, validates input, saves submissions, and navigates to success.",
  "frontend/src/pages/LeadSuccessPage.tsx": "Displays a success message after inquiry submission and clears the inquiry store.",
  "frontend/src/state/inquiryStore.ts": "Implements a persisted Zustand store for managing inquiry items with add, update, remove, and clear actions.",
  "frontend/src/storage/submissions.ts": "Defines a Submission interface and provides functions to save, load, and clear submissions from localStorage.",
  "frontend/src/styles/effects.css": "Contains CSS classes for 3D text and card hover effects with responsive and touch-specific behavior.",
  "frontend/src/utils/galleryInference.ts": "Parses image filenames to auto-generate product names and infer categories using keyword scoring, returning gallery metadata.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, requirements, architectural notes, and current build state for the Prasad Enterprise website."
}